Revit 2027 API
Document.NewSlabEdge(SlabEdgeType, ReferenceArray) Method
Creates a slab edge along a reference array.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SlabEdge NewSlabEdge(
	SlabEdgeType SlabEdgeType,
	ReferenceArray references
)
Public Function NewSlabEdge (
	SlabEdgeType As SlabEdgeType,
	references As ReferenceArray
) As SlabEdge
public:
SlabEdge^ NewSlabEdge(
	SlabEdgeType^ SlabEdgeType,
	ReferenceArray^ references
)
member NewSlabEdge :
        SlabEdgeType : SlabEdgeType *
        references : ReferenceArray -> SlabEdge
Parameters
SlabEdgeType SlabEdgeType
 The type of the slab edge to create
references ReferenceArray
 An array of planar lines and arcs that represents the place where you want to place the slab edge.
Return Value
SlabEdge
 If successful a new slab edge object within the project, otherwise null.
Exceptions
Exception | Condition
ArgumentException | Thrown if the slab edge type does not exist in the given document.
See Also
Reference
Document Class
NewSlabEdge Overload
Autodesk.Revit.Creation Namespace